balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2023.PIC
        <edc:SFRDef edc:access="nnn-------nnnnnn" edc:cname="TRGCON2" edc:desc="" edc:impl="0xe03f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-------000000" edc:name="TRGCON2" edc:nzwidth="0x10" edc:por="000-------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSTRT" edc:desc="" edc:mask="0x3f" edc:name="TRGSTRT" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="TRGDIV" edc:desc="" edc:mask="0x7" edc:name="TRGDIV" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSTRT0" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT1" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT2" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT3" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT4" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT5" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="TRGDIV0" edc:desc="" edc:mask="0x1" edc:name="TRGDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV1" edc:desc="" edc:mask="0x1" edc:name="TRGDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV2" edc:desc="" edc:mask="0x1" edc:name="TRGDIV2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="LEBCON2" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="LEBCON2" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0x7f" edc:name="LEB" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB0" edc:desc="" edc:mask="0x1" edc:name="LEB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB1" edc:desc="" edc:mask="0x1" edc:name="LEB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB2" edc:desc="" edc:mask="0x1" edc:name="LEB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB3" edc:desc="" edc:mask="0x1" edc:name="LEB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB4" edc:desc="" edc:mask="0x1" edc:name="LEB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB5" edc:desc="" edc:mask="0x1" edc:name="LEB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB6" edc:desc="" edc:mask="0x1" edc:name="LEB6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrnnnnnnn----nn" edc:cname="PWMCON3" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000----00" edc:name="PWMCON3" edc:nzwidth="0x10" edc:por="0000000000----00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IUE" edc:desc="" edc:mask="0x1" edc:name="IUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XPRES" edc:desc="" edc:mask="0x1" edc:name="XPRES" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DTC" edc:desc="" edc:mask="0x3" edc:name="DTC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="MDCS" edc:desc="" edc:mask="0x1" edc:name="MDCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ITB" edc:desc="" edc:mask="0x1" edc:name="ITB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGIEN" edc:desc="" edc:mask="0x1" edc:name="TRGIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLIEN" edc:desc="" edc:mask="0x1" edc:name="CLIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTIEN" edc:desc="" edc:mask="0x1" edc:name="FLTIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSTAT" edc:desc="" edc:mask="0x1" edc:name="TRGSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLSTAT" edc:desc="" edc:mask="0x1" edc:name="CLSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTSTAT" edc:desc="" edc:mask="0x1" edc:name="FLTSTAT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="DTC0" edc:desc="" edc:mask="0x1" edc:name="DTC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTC1" edc:desc="" edc:mask="0x1" edc:name="DTC1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
